Repository: AwkwardDev/Kamilla
Catalog: NetworkLogViewer/Strings.*.resx
Languages: ru

source: Error
ru: Ошибка

# ErrorReading
source: An error occured while reading file: {0}
ru: Произошла ошибка во время чтения файла: {0}

# LoadingFile
source: Loading file: {0}
ru: Загрузка файла: {0}

# LW_Cancel
source: Cancel
ru: Отмена

# LW_LoadingPleaseWait
source: Loading, please wait...
ru: Идет загрузка, пожалуйста, подождите...

# LW_Title
source: Loading...
ru: Загрузка...

# Menu_About
source: About Network Log Viewer...
ru: О приложении...

# Menu_CloseFile
source: Close File
ru: Закрыть файл

# Menu_Edit
source: Edit
ru: Правка

# Menu_Exit
source: Exit
ru: Выход

# Menu_File
source: File
ru: Файл

# Menu_Help
source: Help
ru: Справка

# Menu_LanguageWEn
source: Language
ru: Язык (Language)

# Menu_NullProtocol
source: (No Protocol)
ru: (нет протокола)

# Menu_OpenConsole
source: Open Console
ru: Открыть консоль

# Menu_OpenEllipsis
source: Open...
ru: Открыть...

# Menu_Protocols
source: Protocols
ru: Протоколы

# Menu_SaveAs
source: Save As
ru: Сохранить как

# Menu_SaveEllipsis
source: Save...
ru: Сохранить...

# Menu_Skins
source: Skins
ru: Темы

# Menu_View
source: View
ru: Вид

# Menu_ViewPanels
source: View Panels
ru: Панели просмотра

# NetworkLogViewer_Title
source: Network Log Viewer
ru: Программа для просмотра сетевой истории

source: (No Data)
ru: (нет данных)

source: No Network Log
ru: Нет файла

source: No Protocol
ru: Нет протокола

# Skin_KamillaStyle
source: Kamilla Style
ru: Тема Kamilla

# Skin_Windows
source: Windows Style
ru: Тема Windows

# View_BinaryContents
source: Binary Data
ru: Объект

# View_Image
source: Image
ru: Изображение

# View_PacketContents
source: Contents
ru: Пакет

# View_ParsedText
source: Parsed
ru: Данные

# View_TextContents
source: Text Data
ru: Текст

# Menu_AlignPanels
source: Align Panels
ru: Выравнить панели

# Menu_AutoDropCache
source: Auto Flush Cache
ru: Автосброс кэша

# Menu_AutoParse
source: Auto Parse Packets
ru: Автопарсинг пакетов

# Menu_DropCache
source: Flush List Cache
ru: Сбросить кэш списка

# Menu_Search
source: Search
ru: Поиск

# Console_Title
source: Console
ru: Консоль

# View_BinaryContentsN
source: Binary Data #{0}
ru: Блок двоичных данных №{0}

# View_ImageN
source: Image #{0}
ru: Изображение №{0}

# View_UnknownObjectN
source: Unknown Object #{0}
ru: Неизвестный объект №{0}

# View_NoImages
source: No Images
ru: Нет изображений

# View_NoBinaryData
source: No Binary Data
ru: Нет двоичных данных

# EncodingNotFound
source: Encoding '{0}' not found. Please enter a correct text encoding or select an encoding from the list.
ru: Кодировка "{0}" не найдена. Пожалуйста, введите верное название кодировки или выберите кодировку из списка.

# View_ErrorDecoding
source: An error occured while decoding {0}-byte data to string using '{1}' encoding: {2}
ru: Во время преобразования {0} {0?plural-ru:байта:байт:байт} данных в текст используя кодировку '{1}' прозоишла ошибка: {2}

# View_NoTextData
source: No Text Data
ru: Нет текстовых данных

# View_Redecode
source: Redecode
ru: Перекодировать

# View_TextContentsN
source: Text Data #{0}
ru: Текстовые данные №{0}

# View_UnknownObject
source: Unknown Object
ru: Неизвестный объект

# View_ErrorEncoding
source: An error occured while saving text using '{0}' encoding.
ru: Во время сохранения текста в кодировке "{0}" произошла ошибка.

source: Text Files
ru: Текстовые файлы

# View_FailedToSaveIntoFile
source: Failed to save data into file. {0}
ru: Не удалось сохранить данные в файл. {0}

source: Binary Files
ru: Двоичные файлы

# Menu_SaveBinaryContents
source: Save Binary Contents...
ru: Сохранить двоичные данные...

# Menu_SaveParserOutput
source: Save Parser Output...
ru: Сохранить выдачу парсеров...

# Menu_SaveTextContents
source: Save Text Contents...
ru: Сохранить текстовые данные...

# FailedToOpenFile
source: Failed to open file. {0}
ru: Не удалось открыть файл. {0}

# PacketN
source: Packet #{0}
ru: Пакет №{0}

source: Parsing packets...
ru: Обработка пакетов...

# Menu_GoToPacketN
source: Go To Packet...
ru: Перейти к пакету...

# Menu_NextError
source: Go To Next Error
ru: Следующая ошибка

# Menu_NextUndefinedParser
source: Go To Next Undefined Parser
ru: Следующий пакет без парсера

# Menu_NextUnknownOpcode
source: Go To Next Unknown Opcode
ru: Следующий неизвестный опкод

# Search_NotFound
source: No packets found.
ru: Подходящих пакетов не найдено.

source: Searching...
ru: Выполняется поиск...

source: Go To Packet
ru: Перейти к пакету

source: Cancel
ru: Отмена

# GoTo_PacketNumber
source: Packet Number ({0} – {1}):
ru: Номер пакета ({0} – {1}):

source: OK
ru: ОК

source: Search
ru: Искать

# SearchBinaryContents
source: Binary Contents
ru: Двои_чные данные

# SearchCase
source: Match Case
ru: _Учитывать регистр

# SearchClearMarks
source: Clear Marks
ru: Удалить ме_тки

# SearchClose
source: Close
ru: Закрыть

# SearchColon
source: Search:
ru: _Найти:

# SearchCount
source: Count
ru: _Подсчитать

# SearchDirection
source: Direction
ru: Направление

source: Search Down
ru: Искать вни_з

# SearchLoop
source: Looped Search
ru: Зациклить поиск

# SearchMark
source: Mark
ru: От_метить

source: Search Mode
ru: Режим поиска

# SearchOpcodes
source: _Opcodes
ru: _Опкоды

# SearchPacketContents
source: Packet Contents
ru: Данн_ые пакетов

# SearchParserOutput
source: Parser Output
ru: _Выдача парсеров

# SearchRegex
source: Regular Expression
ru: _Регулярное выражение

# SearchTextContents
source: Text Contents
ru: Т_екстовые данные

# SearchTitle
source: Search
ru: Найти

source: Search Up
ru: Искать ввер_х

# SearchEllipsis
source: Search...
ru: Найти...

# SearchModeDesc_Opcodes
source: Specify opcodes you want to find packets with. You can use opcode name or decimal or hexadecimal opcode value.
ru: Укажите опкод, чтобы найти все пакеты с таким опкодом. Вы можете ввести название опкода или его десятичную или шестнадцатеричную запись.

# SearchChars
source: Allow \r, \n, \t, \0
ru: Разре_шить \n, \r, \t, \0

# SearchModeDesc_BinaryContents
source: Specify byte sequence you want to find in binary data contained in packets ('Binary Data' tab). Separate hexadecimal digits with spaces, ? or ?? means any byte.
ru: Введите последовательность байтов, которую вы хотите найти в двоичных данных пакетов (вкладка "Объект"). Разделяйте шестнадцатеричные записи байтов пробелом, используйте ? или ?? для обозначение любого байта.

# SearchModeDesc_PacketContents
source: Specify byte sequence you want to find in packets' data ('Contents' tab). Separate hexadecimal digits with spaces, ? or ?? means any byte.
ru: Введите последовательность байтов, которую вы хотите найти в пакетах (вкладка "Пакет"). Разделяйте шестнадцатеричные записи байтов пробелом, используйте ? или ?? для обозначение любого байта.

# SearchModeDesc_ParserOutput
source: Specify text you want to find in output of packets' parsers ('Parsed' tab).
ru: Введите строку, которую вы хотите найти в данных парсеров (вкладка "Данные").

# SearchModeDesc_TextContents
source: Specify text you want to find in text data contained in packets ('Text Data' tab).
ru: Введите строку, которую вы хотите найти в текстовых данных пакетов (вкладка "Текст").

# SearchFailedNoOpcodes
source: Cannot search by opcode with no opcodes provided by the protocol.
ru: Невозможно искать по опкодам: протокол не поддерживает опкоды.

# SearchString2ByteSeqFailed
source: Failed to convert string '{0}' to byte sequence.
ru: Не удалось преобразовать строку "{0}" в последовательность байтов.

# SearchString2OpcodeFailed
source: Failed to convert string '{0}' to opcode.
ru: Не удалось преобразовать строку "{0}" в опкод.

# SearchString2RegexFailed
source: Failed to convert string '{0}' to a regular expression.
ru: Не удалось преобразовать строку "{0}" в регулярное выражение.

# Menu_Plugins
source: Plugins
ru: Плагины
