Repository: AwkwardDev/Kamilla
Catalog: Kamilla.Wow/Network/Protocols/Wow/WowStrings.*.resx
Languages: ru

source: All Classes
ru: Все классы

source: Alliance Races
ru: Расы Альянса

source: All Races
ru: Все расы

# Class1
source: Warrior
ru: Воин

# Class11
source: Druid
ru: Друид

# Class2
source: Paladin
ru: Паладин

# Class3
source: Hunter
ru: {0?bool:Охотница:Охотник}

# Class4
source: Rogue
ru: {0?bool:Разбойница:Разбойник}

# Class5
source: Priest
ru: {0?bool:Жрица:Жрец}

# Class6
source: Death Knight
ru: Рыцарь Смерти

# Class7
source: Shaman
ru: Шаман

# Class8
source: Mage
ru: Маг

# Class9
source: Warlock
ru: {0?bool:Чернокнижница:Чернокнижник}

# Expac0
source: World of Warcraft (Classic)
ru: World of Warcraft (Оригинал)

# Expac2
source: World of Warcraft: Wrath of the Lich King
ru: World of Warcraft: Гнев Короля-лича

# Expac3
source: World of Warcraft: Cataclysm
ru: World of Warcraft: Катаклизм

# Expac4
source: World of Warcraft: Mists of Pandaria
ru: World of Warcraft: Туманы Пандарии

# Gender0
source: Male
ru: Мужской

# Gender1
source: Female
ru: Женский

# Gender2
source: None
ru: Нет

source: Horde Races
ru: Расы Орды

source: No Classes
ru: Нет классов

source: No Races
ru: Нет рас

# NotPlayableRaces
source: All Not Playable Races
ru: Все неигровые расы

# PlayableRaces
source: All Playable Races
ru: Все игровые расы

# Race1
source: Human
ru: Человек

# Race10
source: Blood Elf
ru: {0?bool:Эльфийка крови:Эльф крови}

# Race11
source: Draenei
ru: Дреней

# Race12
source: Fel Orc
ru: Орк Скверны

# Race13
source: Naga
ru: Нага

# Race14
source: Broken
ru: {0?bool:Падшая:Падший}

# Race15
source: Skeleton
ru: Скелет

# Race16
source: Vrykul
ru: Врайкул

# Race17
source: Tuskarr
ru: Клыкарр

# Race18
source: Forest Troll
ru: Лесной тролль

# Race19
source: Taunka
ru: Таунка

# Race2
source: Orc
ru: Орк

# Race20
source: Northrend Skeleton
ru: Нордскольский скелет

# Race21
source: Ice Troll
ru: Ледяной тролль

# Race22
source: Worgen
ru: Ворген

# Race23
source: Gilneas Human
ru: Житель Гилнеаса

# Race3
source: Dwarf
ru: Дворф

# Race4
source: Night Elf
ru: {0?bool:Ночная эльфийка:Ночной эльф}

# Race5
source: Undead
ru: Нежить

# Race6
source: Tauren
ru: Таурен

# Race7
source: Gnome
ru: Гном

# Race8
source: Troll
ru: Тролль

# Race9
source: Goblin
ru: Гоблин
